app/controllers/fotos_controller.rb

SELECT * FROM `fotos` ORDER BY created_at
---
  def index
    @fotos = Foto.all(:order => :created_at)

SELECT * FROM `fotos` WHERE (`fotos`.`id` = 1)
---
  def show
    @foto = Foto.find(params[:id])

INSERT INTO `fotos` (`name`, `foto_updated_at`, `updated_at`, `foto_file_size`, `lng`, `foto_content_type`, `description`, `foto_file_name`, `lat`, `created_at`) VALUES('Neu', '2009-10-24 18:36:34', '2009-10-24 18:36:34', 256036, -52.3828125, 'image/png', 'Hier wirds beschrieben', '090423_redesign_03.png', -11.8214641468593, '2009-10-24 18:36:34')
---
  def create
    @foto = Foto.new(params[:foto])
    if @foto.save

SELECT * FROM `fotos` WHERE (`fotos`.`id` = 2)
---
  def edit
    @foto = Foto.find(params[:id])

SELECT * FROM `fotos` WHERE (`fotos`.`id` = 5)
UPDATE `fotos` SET `lat` = 51.7415429974407, `lng` = 9.788818359375, `description` = 'Nackt vor der Wand', `updated_at` = '2009-10-24 18:29:40' WHERE `id` = 6
---
  def update
    @foto = Foto.find(params[:id])
    if @foto.update_attributes(params[:foto])

SELECT * FROM `fotos` WHERE (`fotos`.`id` = 1)
DELETE FROM `fotos` WHERE `id` = 1
---
  def destroy
    @foto = Foto.find(params[:id])
    @foto.destroy